gzehentner/ESP32_Projects/Wasserstand_ESP_V05/src/Wasserstand_V5.cpp
  // define the pages and other content for the webserver
  server.on("/", handlePage);      // send root page
  server.on("/0.htm", handlePage); // a request can reuse another handler
  // problems with too big data --> still disabled
  //server.on("/graph_poc.htm", handleGraph_POC); // display a chart with print on change values based on google graph
  server.on("/graph.htm", handleGraph); // display a chart with shortterm values
  server.on("/longterm_graph.htm", handleLongtermGraph);
  server.on("/filtered.htm",handleListFiltered);

  server.on("/f.css", handleCss); // a stylesheet
  server.on("/j.js", handleJs);   // javscript based on fetch API to update the page
  //server.on("/jslider.js", handleSliderJs);   // javscript display of slider value
  // server.on("/j.js",  handleAjax);             // a javascript to handle AJAX/JSON update of the page  https://werner.rothschopf.net/201809_arduino_esp8266_server_client_2_ajax.htm
  server.on("/json", handleJson);    // send data in JSON format
  server.on("/c.php", handleCommand);            // process commands
                                     //  server.on("/favicon.ico", handle204);          // process commands
  server.onNotFound(handleNotFound); // show a typical HTTP Error 404 page
  //server.on("/slider.htm",handleSlider);

  // the next two handlers are necessary to receive and show data from another module
  server.on("/d.php", handleData);               // receives data from another module
  server.on("/r.htm", handlePageR);              // show data as received from the remote module


  // following settings are coming from AdvancedWebServer
  // server.on("/test.svg", drawGraph);
  // server.on("/inline", []() {
  //   server.send(200, "text/plain", "this works as well");
  // });

  server.begin(); // start the webserver
  Serial.println(F("HTTP server started"));
  /*=====================   end fo prepare webserver  ===============*/
  
  /*=================================================================*/
  /* IDE OTA */
  ArduinoOTA.setHostname(myhostname); // give a name to your ESP for the Arduino IDE
  ArduinoOTA.begin();                 // OTA Upload via ArduinoIDE https://arduino-esp8266.readthedocs.io/en/latest/ota_updates/readme.html



  
  /*=================================================================*/
  beginCurrentLoopSensor();
  
  Serial.print("is_life_system: ");
  Serial.println(isLiveSystem);
  
  #if MyUSE_ADC == ADS1115_ADC
    /*==================================================================*/
    // Prepare analog output
    //  pinMode(LED_PIN, OUTPUT);

    #if BOARDTYPE == ESP32
    /*==================================================================*/
    // prepare I2C interface
      I2CSensors.begin(I2C_SDA, I2C_SCL, 100000);
    #endif

    /*==================================================================*/
    // prepare analog read from ads1115 via I2C
    // ADS 1115 (0x48 .. 0x4B will be the address)
    #if BOARDTYPE == ESP8266
      Wire.begin(I2C_SDA,I2C_SCL);
    #endif

    // check if ADS is runnint
    #if BOARDTYPE == ESP32
      // for ESP32
      if (!ads.begin(0x48, &I2CSensors))
    #else
      // for ESP 8266
      if (!ads.begin())
    #endif
    {
      Serial.println("Couldn't Find ADS 1115");
      //while  (1) // endless loop is not good, because ESP is not updatable by OTA
        ;
    }
    else
    {
      Serial.println("ADS 1115 Found");
      ads.setGain(GAIN_ONE);
      Serial.print("Gain: ");
      Serial.println(ads.getGain());
    }

    #if BOARDTYPE == ESP32
      // PSRAM available?
      log_d("Total heap: %d", ESP.getHeapSize());
      log_d("Free heap: %d", ESP.getFreeHeap());
      log_d("Total PSRAM: %d", ESP.getPsramSize());
      log_d("Free PSRAM: %d", ESP.getFreePsram());
    #endif
  #endif

  //==========================================
  // prepare logfile

  // Serial.println("Formatting LittleFS filesystem");
  // LittleFS.format();

  Serial.println("Mount LittleFS");
  if (!LittleFS.begin()) {
    Serial.println("LittleFS mount failed");
    return;
  }
  
  // this var is set in platformio.ini (this doesnot work??)
  #define deleteLogfile 0
  #if deleteLogfile == 1
    // deleting logfile
    Serial.println("deleting logfile");
    deleteFile("/level.log");
  #else
    Serial.println("NOT!!! deleting logfile");
  #endif
  listDir("/");  
}
  /*==================================================================*/
  

/*****************************************************************************************************************
 *****************************************************************************************************************
         M A I N L O O P
 *****************************************************************************************************************
 *****************************************************************************************************************/
 

void loop(void) {

  // **************************************************************************************************
  // ===============================================================================
  // following actions are triggered every 500 ms
  if (millis() - previousMillis_halfSecondAction > halfSecond)
  {

    /*=================================================================*/
    /*  code for getting time from NTP       */
    getEpochTime(epochTime);
    formatDateAndTime(formattedTime, currentDate,epochTime);
    /* End getting time and date */
    
    previousMillis_halfSecondAction = millis();
  }
  // ===============================================================================
  // **************************************************************************************************
  
  // ============================================================================
  // In simulation mode:
  //       Simulate level and relais outputs
  //
  //  GZE shift to a separat file
  // ============================================================================
  if (debugLevelSwitches != debugLevelSwitches_old) {
    if (debugLevelSwitches == 1) {
      // set default values to last actual values, when debug is switched on 
      Serial.print("val_AHH: "); Serial.println(val_AHH);
      Serial.print("val_AH:  "); Serial.println(val_AH);
      Serial.print("val_AL:  "); Serial.println(val_AL);
      simVal_AHH = val_AHH;
      simVal_AH  = val_AH;
      simVal_AL  = val_AL;
      pinMode(GPin_AHH, OUTPUT);
      pinMode(GPin_AH,  OUTPUT);
      pinMode(GPin_AL,  OUTPUT);
      
      digitalWrite(GPin_AHH, simVal_AHH);
      digitalWrite(GPin_AH , simVal_AH);
      digitalWrite(GPin_AL , simVal_AL);
      Serial.println("debug level enabled");
    } else {
      pinMode(GPin_AHH, INPUT_PULLUP);
      pinMode(GPin_AH,  INPUT_PULLUP);
      pinMode(GPin_AL, INPUT_PULLUP);
      Serial.println("debug level disabled");
    }
  }
  debugLevelSwitches_old = debugLevelSwitches;

  // **************************************************************************************************
  // **************************************************************************************************
  /* WebClient */

  seconds_since_startup = millis() / 1000;
  if (clientIntervall > 0 && (seconds_since_startup - clientPreviousSs) >= clientIntervall)
  {
    sendPost();
    //sendPost_V2();
    clientPreviousSs = seconds_since_startup;
  }
  server.handleClient();

  // **************************************************************************************************
  // **************************************************************************************************

  /* Over the Air UPdate */
  ArduinoOTA.handle(); // OTA Upload via ArduinoIDE

  // **************************************************************************************************
  // **************************************************************************************************
  /* evaluate water level */
  // **************************************************************************************************

  Current2Waterlevel();
 
  SetAlarmState_from_relais();
  SetAlarmState_from_level();
  calculateWorstCaseAlarmState();

