gzehentner/ESP32_Projects/Wasserstand_ESP_V05/src/Wasserstand_V5.cpp
  prepareSendMail();

  // **************************************************************************************************
  // **************************************************************************************************
  /* Send Email reusing session   */
  // **************************************************************************************************

  if (executeSendMail)
  {
     executeSendMail = false;

    SMTP_Message message;
    
    /* The attachment data item */
    SMTP_Attachment att[2];
    int attIndex = 0;
    // GZE  weitere Definitionen siehe ESP Mail Client/ examples / SMTP / Send_attachment_File

    message.sender.name = F("Pegel Zehentner");
    message.sender.email = AUTHOR_EMAIL;
    message.subject = subject;

    message.addRecipient(F("Schorsch"), RECIPIENT_EMAIL);

    // htmlMsg already set by Evaluate Sensor
    message.html.content = htmlMsg;
    message.text.content = F("");

    Serial.println();
    Serial.println(F("Sending Email..."));

    if (!smtp.isLoggedIn())
    {
      /* Set the TCP response read timeout in seconds */
      smtp.setTCPTimeout(10);
      
      if (!smtp.connect(&config))
      {
        MailClient.printf("Connection error, Status Code: %d, Error Code: %d, Reason: %s\n", smtp.statusCode(), smtp.errorCode(), smtp.errorReason().c_str());
        goto exit;
      }

      if (!smtp.isLoggedIn())
      {
        Serial.println(F("Error, Not yet logged in."));
        goto exit;
      }
      else
      {
        if (smtp.isAuthenticated())
          Serial.println(F("Successfully logged in."));
        else
          Serial.println(F("Connected with no Auth."));
      }
    }
    
    if (!MailClient.sendMail(&smtp, &message, false))
      MailClient.printf("Error, Status Code: %d, Error Code: %d, Reason: %s\n", smtp.statusCode(), smtp.errorCode(), smtp.errorReason().c_str());

  exit:

    heapInfo.collect();
    heapInfo.print();

    /*=END Send_Reuse_Session =====================================*/
  }
  
  // **************************************************************************************************
  // **************************************************************************************************
  /*===========================================================
    simulate changing waterlevel
   */
  #ifdef SIM_FADING_LEVEL
    // change the dutycylce for next time through the loop:
    pegel = pegel + fadeAmount;

    // reverse the direction of the fading at the ends of the fade:
    if (pegel <= Level_ALL/100.0-0.05 || pegel >= Level_AHH/100.0+0.05) {
      fadeAmount = -fadeAmount;
    }
  #endif // SIM_FADING_LEVEL
  // **************************************************************************************************


  // **************************************************************************************************
  #ifdef DEBUG_PRINT_RAW
  // **************************************************************************************************
    /*=================================================================*/
    // read analog value via I2C for debug
    // not used in live system
    //===========================================
    const int loc_maxAdc_value = 0x7FFF;
    float voltage=0.0;

    Serial.println("=================================");
    adc0 = ads.readADC_Differential_0_1();
    Serial.print("Analog input pin 0: "); Serial.println(adc0);

  // voltage = ads.computeVolts(adc0);   
  // Serial.print("Voltage: "); Serial.println(voltage);

   #endif // DEBUG_PRINT_RAW
  // **************************************************************************************************


  
  // **************************************************************************************************
  #ifdef DEBUG_PRINT_CYCLIC
  // **************************************************************************************************
    if (millis() - previousMillisCyclicPrint > WaitingTimeCyclicPrint)
    {
      // Serial.print(formattedTime);
      // heapInfo.collect();
      // heapInfo.print();
      
      //Serial.print("millisNow : ");Serial.print(opTime_millisNow);Serial.print(" millisDiff : ");Serial.println(opTime_millisDiff);
      // Serial.print(myValueFilteredAct);
      // Serial.print(" - AlarmStateLevel: "); Serial.print(alarmStateLevel);
      // Serial.print("  pumpA: "); Serial.print(pumpA_op); Serial.print("  time : "); Serial.print(pumpA_operationTime);
      // Serial.print("  pumpB: "); Serial.print(pumpB_op); Serial.print("  time : "); Serial.println(pumpB_operationTime);
      

      previousMillisCyclicPrint = millis();
    }
  #endif


  controlPump();
  measureOperatingTime();
  

  // input command via serial interface
  //**************************************************************************************


  millisNow = millis();

  if (millisNow - lastMillis >= 2000) {
    lastMillis = millisNow;
    doPrint = 1;

    //Serial.println(".");
    value ++;
  }

  // serial input is not yet working reliably
#ifdef useSerialInput
// if there's any serial available, read it:
  if (Serial.available() > 0) {

    receivedString= Serial.readString();

    Serial.println();
    Serial.println("rec: " + receivedString) + "---";
    Serial.println(";");

    Serial.println("len: " + (receivedString.length()));

    if (receivedString == "r") {
      Serial.println("executing readFile");
      
    }

    // 'R': read complete file at once 
    // if (c == 'R') {
    //   Serial.print("2");

    //   Serial.println("executing readFile");
    //   readFile("/level.log");
      
    // }
  

    // // "r": read file line by line
    // if (c == 'r'){
    //   Serial.print("3");
    //   // open file for reading and check if it exists
    //   File file = LittleFS.open("/level.log", "r");
    //   if (!file) {
    //     Serial.println("Failed to open file for reading");
    //     return;
    //   }

    //   while (file.available()) { 
    //     String fileData = "";
    
    //     fileData  = file.read();
    //     Serial.print ("fileData : "); Serial.println(fileData);
    
