gzehentner/ESP32_Projects/Wasserstand_ESP_V05/src/Wasserstand_V5.cpp
    //   }
    
   }
   #endif //useSerialInput

   
  
  // **************************************************************************************************
  // set a delay to avoid ESP is busy all the time
  //     allow the cpu to switch to other tasks
  
  delay(2);

  doPrint = 0;
  // **************************************************************************************************
  // **************************************************************************************************
} // end void loop()
  // **************************************************************************************************
  // **************************************************************************************************


/* Callback function to get the Email sending status */
void smtpCallback(SMTP_Status status)
{

  Serial.println(status.info());

  if (status.success())
  {

    Serial.println(F("----------------"));
    MailClient.printf("Message sent success: %d\n", status.completedCount());
    MailClient.printf("Message sent failed: %d\n", status.failedCount());
    Serial.println(F("----------------\n"));

    for (size_t i = 0; i < smtp.sendingResult.size(); i++)
    {
      SMTP_Result result = smtp.sendingResult.getItem(i);

      MailClient.printf("Message No: %d\n", i + 1);
      MailClient.printf("Status: %s\n", result.completed ? "success" : "failed");
      MailClient.printf("Date/Time: %s\n", MailClient.Time.getDateTimeString(result.timestamp, "%B %d, %Y %H:%M:%S").c_str());
      MailClient.printf("Recipient: %s\n", result.recipients.c_str());
      MailClient.printf("Subject: %s\n", result.subject.c_str());
    }
    Serial.println("----------------\n");

    smtp.sendingResult.clear();
  }
}

